{
	"res://GeneratedLevels/level_1.tscn": [
	  "[b]Welcome to the Self-Driving Taxi Adventure![/b]\n\nIn this game, you'll learn to write code to control your taxi and pick up passengers.",
	  "Use the [color=#80CCFF]Code Editor[/color] to write instructions for your taxi.\n\nFor example, try typing:\n[code]drive()[/code]\nand then click [color=#80CCFF]Run[/color] to move your taxi forward in the direction it's facing.",
	  "The basic commands you can use are:\n[code]drive()[/code] - Move forward in the direction you're facing\n[code]turn_left()[/code] - Rotate 90° counter-clockwise\n[code]turn_right()[/code] - Rotate 90° clockwise\n[code]pick_up()[/code] - Pick up a passenger next to your taxi\n[code]deliver()[/code] - Deliver a passenger to their matching destination",
	  "Each passenger has a colored indicator showing their destination.\n\nBe careful not to hit passengers with your taxi! Hitting a passenger will restart the level.\n\nGood luck on your taxi service coding journey!"
	],
	"res://GeneratedLevels/level_2.tscn": [
	  "[b]Level 2: Passengers & Destinations[/b]\n\nIn this level, you'll learn to pick up passengers and deliver them to their destinations.",
	  "Position your taxi next to a passenger and use:\n[code]pick_up()[/code]\n\nThe passenger's colored indicator shows their destination.",
	  "To deliver a passenger, drive to their matching destination (same color) and use:\n[code]deliver()[/code]",
	  "Complete the level by delivering all passengers to their destinations. Remember, your taxi can hold multiple passengers at once!"
	],
	"res://GeneratedLevels/level_3.tscn": [
	  "[b]Level 3: Efficient Routing[/b]\n\nNow let's optimize your delivery route using loops and planning.",
	  "Plan an efficient route to pick up and deliver multiple passengers.\n\nFor example:\n[code]drive()\nturn_right()\ndrive()\npick_up()\nturn_left()\ndrive()\ndeliver()[/code]",
	  "You can use loops to repeat common movements:\n[code]for i in range(3):\n    drive()\n    turn_right()[/code]",
	  "Try to deliver all passengers in as few lines of code as possible!"
	],
	"res://GeneratedLevels/level_4.tscn": [
	  "[b]Level 4: Functions & Advanced Routing[/b]\n\nCreate functions to make your code more organized and reusable.",
	  "Define a function like this:\n[code]func go_to_passenger():\n    drive()\n    turn_right()\n    drive()\n    pick_up()[/code]",
	  "Then call it like this:\n[code]go_to_passenger()[/code]",
	  "Try creating functions for different patterns like navigating to a passenger, picking them up, and delivering them to their destination."
	]
  }
